Config = {}

Config["Setting"] = {
	
	["Key"] = 38 , -- ปุ่มที่จะใช้วาป  https://docs.fivem.net/docs/game-references/controls/
	["allowed_vehicle"] = false, -- จะให้วาปไปทั้งรถทั้งคนเลยไหม ?
	
}

Config["Menu"] = {
	
	["enable"] = false, -- เปิดให้ใช้เมนูวาปไหม ?
	["position"] = "top-right", -- ตำแหน่งของเมนู
	
}

Config["Text"] = {
	
	["menu_tittle"] = "เมนูวาป", -- หัวข้อเมนู
	
}

Config["Warp"] = {
	
	[1] = { -- หัวข้อหลัก
		
		["enable"] = false, -- จะเปิดหมวดหมู่นี้ไหม ถ้าปรับเป็น false จะไม่โชว์
		["name"] = "โซนวาปเมืองหลัก", -- ชื่อหมวดหมู่
		
		["List"] = { -- รายชื่อวาปทั้งหมด	
			
			[1] = {
				
				["enable"] = false, -- ถ้าปรับเป็น false จะไม่ขึ้นในหมวดหมู่ /tp
				["name"] = "ทางเข้า TC", -- ชื่อจุดวาป [0x03]
				["position"] = { x = 3830.7, y = 794.5, z = 81.8, h = 213.1 }, -- ตำแหน่งที่จะวาปไป (h = heading จุดที่จะหันหน้าไป)
				
			},
			
			[2] = {
				
				["enable"] = false, -- ถ้าปรับเป็น false จะไม่ขึ้นในหมวดหมู่ /tp
				["name"] = "ออกไปTC", -- ชื่อจุดวาป [0x03]
				["position"] = { x = -827.1, y = -1327.4, z = 4.9, h = 334.4 }, -- ตำแหน่งที่จะวาปไป (h = heading จุดที่จะหันหน้าไป)
				
			},

			[3] = {
				
				["enable"] = false, -- ถ้าปรับเป็น false จะไม่ขึ้นในหมวดหมู่ /tp
				["name"] = "เข้าเมือง", -- ชื่อจุดวาป [0x03]
				["position"] = { x = -315.8, y = -922.8, z = 31.6, h = 257.9 }, -- ตำแหน่งที่จะวาปไป (h = heading จุดที่จะหันหน้าไป)
				
			},



			[4] = {
				
				["enable"] = false, -- ถ้าปรับเป็น false จะไม่ขึ้นในหมวดหมู่ /tp
				["name"] = "เข้าเกาะลอยฟ้า", -- ชื่อจุดวาป [0x03]
				["position"] = {x = 4268.0, y = 5697.9, z = 254.8, h = 355.1}, -- ตำแหน่งที่จะวาปไป (h = heading จุดที่จะหันหน้าไป)
				
			},

			[5] = {
				
				["enable"] = false, -- ถ้าปรับเป็น false จะไม่ขึ้นในหมวดหมู่ /tp
				["name"] = "เข้าเมือง", -- ชื่อจุดวาป [0x03]
				["position"] = { x = -386.0, y = 1186.9, z = 325.7, h = 73.4}, -- ตำแหน่งที่จะวาปไป (h = heading จุดที่จะหันหน้าไป)
				
			},
			
			[6] = {
				
				["enable"] = false, -- ถ้าปรับเป็น false จะไม่ขึ้นในหมวดหมู่ /tp
				["name"] = "เข้าเกาะลอยฟ้า", -- ชื่อจุดวาป [0x03]
				["position"] = {x = -1784.9, y = 3083.9, z = 34.2, h = 331.7}, -- ตำแหน่งที่จะวาปไป (h = heading จุดที่จะหันหน้าไป)
				
			},
			[7] = {
				
				["enable"] = false, -- ถ้าปรับเป็น false จะไม่ขึ้นในหมวดหมู่ /tp
				["name"] = "เข้าเกาะลอยฟ้า", -- ชื่อจุดวาป [0x03]
				["position"] = {x = -3908.0, y = 7289.2, z = 1631.3, h = 183.3}, -- ตำแหน่งที่จะวาปไป (h = heading จุดที่จะหันหน้าไป)
				
			},
		}
	}

}


--- เข้าTC x = -789.0, y = -1346.9, z = 5.1, h = 268.0
--- ออกไปโดม  x = 3827.2, y = 800.5, z = 81.8, h = 33.5

--- ออกโดม  x = 3830.7, y = 794.5, z = 81.8, h = 213.1
--- ออกไปTC x = -794.1, y = -1347.9, z = 5.1, h = 107.4



Config["Gate"] = {
	
	["Setting"] = {
		
		["enable"] = true, -- เปิดใช้งานเกทวาปทั้งหมดไหม ?
		["font"] = "font4thai",
		["delay"] = 1000, -- เวลาในการกดเปิดวาปแต่ละครั้ง
		["draw_dist_text"] = 10.0, -- ระยะที่จะโชว์ข้อความ
		["draw_dist_press"] = 2.0, -- ระยะที่จะกดปุ่มได้ 
		
	},
	
	["List"] = {
		-- 1
		{
			
			["enable"] = false, -- เปิดจุดนี้ไหม ?
			["catalog"] = 1, -- หมวดหมู่ อิงจาก [0x01]
			["name"] = 1, -- ชื่อวาปที่จะวาปไป ดูได้จาก Config["List"] อิงจาก [0x03]
			["position"] = { x = -794.1, y = -1347.9, z = 5.1, h = 107.4 }, -- ตำแหน่งประตูวาป (กด E ใกล้ๆจะมีเมนูวาปให้ยืนยัน)
			
			["anim"] = {
				
				["enable"] = true, -- จะให้มีเอนิเมชั่นตอนวาปไหม ถ้าไม่จะวาปไปดื้อๆเลย
				["dict"] = "anim@arena@celeb@podium@no_prop@",  -- dict หรือ หมวดหมู่ของเอนิเมชั่น 
				["name"] = "regal_c_1st", -- ชื่ออนิเมชั่น
				
			},
			
			["progressbar"] = { -- หลอดโหลด
				
				["tittle"] = "['คำสั่งวาป']", -- หัวข้อบน progressbar
				["text"] = "กำลังทำการย้ายพื้นที่", -- ข้อความบน progressbar
				["time"] = 3000, -- เวลาในการวาป
			},
			
			["confirm"] = {
				
				["enable"] = true, -- จะให้ยืนยันตอนกดวาปไหม ถ้าเป็น false กดแล้วก็จะวาปเลย?
				["text"] = "คุณต้องการเดินเข้าไปในพื้นที่ของ TC หรือไม่", -- ข้อความยืนยันตอนวาป
				
			},
			
			["text"] = {
				
				["enable"] = true, -- เปิดใช้งานข้อความไหม
				["size"] = 1.5, -- ขนาด text
				["text"] = "กดปุ่ม E เพื่อวาปเข้าไปยัง TC", -- ข้อความที่จะแสดงจุดวาปถ้าเว้นว่างไว้จะเป็นการโชว์ชื่อจุดวาปแทน
				
			}
			
			
		},
		-- 2
		{
			
			["enable"] = false, -- เปิดจุดนี้ไหม ?
			["catalog"] = 1, -- หมวดหมู่ อิงจาก [0x01]
			["name"] = 2, -- ชื่อวาปที่จะวาปไป ดูได้จาก Config["List"] อิงจาก [0x03]
			["position"] = { x = 3827.2, y = 800.5, z = 81.8, h = 33.5 }, -- ตำแหน่งประตูวาป (กด E ใกล้ๆจะมีเมนูวาปให้ยืนยัน)
			
			["anim"] = {
				
				["enable"] = true, -- จะให้มีเอนิเมชั่นตอนวาปไหม ถ้าไม่จะวาปไปดื้อๆเลย
				["dict"] = "anim@arena@celeb@podium@no_prop@",  -- dict หรือ หมวดหมู่ของเอนิเมชั่น 
				["name"] = "regal_c_1st", -- ชื่ออนิเมชั่น
				
			},
			
			["progressbar"] = { -- หลอดโหลด
				
				["tittle"] = "['คำสั่งวาป']", -- หัวข้อบน progressbar
				["text"] = "กำลังทำการย้ายพื้นที่", -- ข้อความบน progressbar
				["time"] = 3000, -- เวลาในการวาป
			},
			
			["confirm"] = {
				
				["enable"] = true, -- จะให้ยืนยันตอนกดวาปไหม ถ้าเป็น false กดแล้วก็จะวาปเลย?
				["text"] = "คุณต้องการเดินเข้าไปในพื้นที่ของ TC หรือไม่", -- ข้อความยืนยันตอนวาป
				
			},
			
			["text"] = {
				
				["enable"] = true, -- เปิดใช้งานข้อความไหม
				["size"] = 1.5, -- ขนาด text
				["text"] = "กดปุ่ม E เพื่อวาปเข้าไปยัง TC", -- ข้อความที่จะแสดงจุดวาปถ้าเว้นว่างไว้จะเป็นการโชว์ชื่อจุดวาปแทน
				
			}
			
			
		},

		{
			
			["enable"] = false, -- เปิดจุดนี้ไหม ?
			["catalog"] = 1, -- หมวดหมู่ อิงจาก [0x01]
			["name"] = 3, -- ชื่อวาปที่จะวาปไป ดูได้จาก Config["List"] อิงจาก [0x03]
			["position"] = { x = -3206.7, y = -935.0, z = 130.1, h = 46.5}, -- ตำแหน่งประตูวาป (กด E ใกล้ๆจะมีเมนูวาปให้ยืนยัน)
			
			["anim"] = {
				
				["enable"] = true, -- จะให้มีเอนิเมชั่นตอนวาปไหม ถ้าไม่จะวาปไปดื้อๆเลย
				["dict"] = "anim@arena@celeb@podium@no_prop@",  -- dict หรือ หมวดหมู่ของเอนิเมชั่น 
				["name"] = "regal_c_1st", -- ชื่ออนิเมชั่น
				
			},
			
			["progressbar"] = { -- หลอดโหลด
				
				["tittle"] = "['คำสั่งวาป']", -- หัวข้อบน progressbar
				["text"] = "กำลังทำการย้ายพื้นที่", -- ข้อความบน progressbar
				["time"] = 3000, -- เวลาในการวาป
			},
			
			["confirm"] = {
				
				["enable"] = true, -- จะให้ยืนยันตอนกดวาปไหม ถ้าเป็น false กดแล้วก็จะวาปเลย?
				["text"] = "คุณต้องการเดินเข้าไปในเมืองหรือไม่", -- ข้อความยืนยันตอนวาป
				
			},
			
			["text"] = {
				
				["enable"] = true, -- เปิดใช้งานข้อความไหม
				["size"] = 1.5, -- ขนาด text
				["text"] = "กดปุ่ม E เพื่อวาปเข้าเมือง", -- ข้อความที่จะแสดงจุดวาปถ้าเว้นว่างไว้จะเป็นการโชว์ชื่อจุดวาปแทน
				
			}
			
			
		},

		
		{
			
			["enable"] = false, -- เปิดจุดนี้ไหม ?
			["catalog"] = 1, -- หมวดหมู่ อิงจาก [0x01]
			["name"] = 3, -- ชื่อวาปที่จะวาปไป ดูได้จาก Config["List"] อิงจาก [0x03]
			["position"] = { x = -3270.4, y = -932.1, z = 130.1, h = 134.6}, -- ตำแหน่งประตูวาป (กด E ใกล้ๆจะมีเมนูวาปให้ยืนยัน)
			
			["anim"] = {
				
				["enable"] = true, -- จะให้มีเอนิเมชั่นตอนวาปไหม ถ้าไม่จะวาปไปดื้อๆเลย
				["dict"] = "anim@arena@celeb@podium@no_prop@",  -- dict หรือ หมวดหมู่ของเอนิเมชั่น 
				["name"] = "regal_c_1st", -- ชื่ออนิเมชั่น
				
			},
			
			["progressbar"] = { -- หลอดโหลด
				
				["tittle"] = "['คำสั่งวาป']", -- หัวข้อบน progressbar
				["text"] = "กำลังทำการย้ายพื้นที่", -- ข้อความบน progressbar
				["time"] = 3000, -- เวลาในการวาป
			},
			
			["confirm"] = {
				
				["enable"] = true, -- จะให้ยืนยันตอนกดวาปไหม ถ้าเป็น false กดแล้วก็จะวาปเลย?
				["text"] = "คุณต้องการเดินเข้าไปในเมืองหรือไม่", -- ข้อความยืนยันตอนวาป
				
			},
			
			["text"] = {
				
				["enable"] = true, -- เปิดใช้งานข้อความไหม
				["size"] = 1.5, -- ขนาด text
				["text"] = "กดปุ่ม E เพื่อวาปเข้าเมือง", -- ข้อความที่จะแสดงจุดวาปถ้าเว้นว่างไว้จะเป็นการโชว์ชื่อจุดวาปแทน
				
			}
			
			
		},


		{
			
			["enable"] = false, -- เปิดจุดนี้ไหม ?
			["catalog"] = 1, -- หมวดหมู่ อิงจาก [0x01]
			["name"] = 4, -- ชื่อวาปที่จะวาปไป ดูได้จาก Config["List"] อิงจาก [0x03]
			["position"] = {x = -383.1, y = 1199.6, z = 325.7, h = 255.6}, -- ตำแหน่งประตูวาป (กด E ใกล้ๆจะมีเมนูวาปให้ยืนยัน)   
			
			["anim"] = {
				
				["enable"] = true, -- จะให้มีเอนิเมชั่นตอนวาปไหม ถ้าไม่จะวาปไปดื้อๆเลย
				["dict"] = "anim@arena@celeb@podium@no_prop@",  -- dict หรือ หมวดหมู่ของเอนิเมชั่น 
				["name"] = "regal_c_1st", -- ชื่ออนิเมชั่น
				
			},
			
			["progressbar"] = { -- หลอดโหลด
				
				["tittle"] = "['คำสั่งวาป']", -- หัวข้อบน progressbar
				["text"] = "กำลังทำการย้ายพื้นที่", -- ข้อความบน progressbar
				["time"] = 3000, -- เวลาในการวาป
			},
			
			["confirm"] = {
				
				["enable"] = true, -- จะให้ยืนยันตอนกดวาปไหม ถ้าเป็น false กดแล้วก็จะวาปเลย?
				["text"] = "คุณต้องการไปเกาะลอยฟ้าหรือไม่", -- ข้อความยืนยันตอนวาป
				
			},
			
			["text"] = {
				
				["enable"] = true, -- เปิดใช้งานข้อความไหม
				["size"] = 1.5, -- ขนาด text
				["text"] = "กดปุ่ม E เพื่อไป AFK", -- ข้อความที่จะแสดงจุดวาปถ้าเว้นว่างไว้จะเป็นการโชว์ชื่อจุดวาปแทน
				
			}
			
			
		},
		
		{
			
			["enable"] = false, -- เปิดจุดนี้ไหม ?
			["catalog"] = 1, -- หมวดหมู่ อิงจาก [0x01]
			["name"] = 5, -- ชื่อวาปที่จะวาปไป ดูได้จาก Config["List"] อิงจาก [0x03]
			["position"] = {x = 4264.8, y = 5727.4, z = 255.7, h = 10.4}, -- ตำแหน่งประตูวาป (กด E ใกล้ๆจะมีเมนูวาปให้ยืนยัน)   
			
			["anim"] = {
				
				["enable"] = true, -- จะให้มีเอนิเมชั่นตอนวาปไหม ถ้าไม่จะวาปไปดื้อๆเลย
				["dict"] = "anim@arena@celeb@podium@no_prop@",  -- dict หรือ หมวดหมู่ของเอนิเมชั่น 
				["name"] = "regal_c_1st", -- ชื่ออนิเมชั่น
				
			},
			
			["progressbar"] = { -- หลอดโหลด
				
				["tittle"] = "['คำสั่งวาป']", -- หัวข้อบน progressbar
				["text"] = "กำลังทำการย้ายพื้นที่", -- ข้อความบน progressbar
				["time"] = 3000, -- เวลาในการวาป
			},
			
			["confirm"] = {
				
				["enable"] = true, -- จะให้ยืนยันตอนกดวาปไหม ถ้าเป็น false กดแล้วก็จะวาปเลย?
				["text"] = "คุณต้องการกลับเข้าเมืองหรือไม่", -- ข้อความยืนยันตอนวาป
				
			},
			
			["text"] = {
				
				["enable"] = true, -- เปิดใช้งานข้อความไหม
				["size"] = 1.5, -- ขนาด text
				["text"] = "กดปุ่ม E เพื่อกลับเมือง", -- ข้อความที่จะแสดงจุดวาปถ้าเว้นว่างไว้จะเป็นการโชว์ชื่อจุดวาปแทน
				
			}
			
			
		},
		{
			
			["enable"] = false, -- เปิดจุดนี้ไหม ?
			["catalog"] = 1, -- หมวดหมู่ อิงจาก [0x01]
			["name"] = 6, -- ชื่อวาปที่จะวาปไป ดูได้จาก Config["List"] อิงจาก [0x03]
			["position"] = {x = -3907.8, y = 7302.5, z = 1631.3, h = 6.5}, -- ตำแหน่งประตูวาป (กด E ใกล้ๆจะมีเมนูวาปให้ยืนยัน)   
			
			["anim"] = {
				
				["enable"] = true, -- จะให้มีเอนิเมชั่นตอนวาปไหม ถ้าไม่จะวาปไปดื้อๆเลย
				["dict"] = "anim@arena@celeb@podium@no_prop@",  -- dict หรือ หมวดหมู่ของเอนิเมชั่น 
				["name"] = "regal_c_1st", -- ชื่ออนิเมชั่น
				
			},
			
			["progressbar"] = { -- หลอดโหลด
				
				["tittle"] = "['คำสั่งวาป']", -- หัวข้อบน progressbar
				["text"] = "กำลังทำการย้ายพื้นที่", -- ข้อความบน progressbar
				["time"] = 3000, -- เวลาในการวาป
			},
			
			["confirm"] = {
				
				["enable"] = true, -- จะให้ยืนยันตอนกดวาปไหม ถ้าเป็น false กดแล้วก็จะวาปเลย?
				["text"] = "คุณต้องการกลับเข้าเมืองหรือไม่", -- ข้อความยืนยันตอนวาป
				
			},
			
			["text"] = {
				
				["enable"] = true, -- เปิดใช้งานข้อความไหม
				["size"] = 1.5, -- ขนาด text
				["text"] = "กดปุ่ม E เพื่อกลับเมือง", -- ข้อความที่จะแสดงจุดวาปถ้าเว้นว่างไว้จะเป็นการโชว์ชื่อจุดวาปแทน
				
			}
			
			
		},

		{
			
			["enable"] = false, -- เปิดจุดนี้ไหม ?
			["catalog"] = 1, -- หมวดหมู่ อิงจาก [0x01]
			["name"] = 7, -- ชื่อวาปที่จะวาปไป ดูได้จาก Config["List"] อิงจาก [0x03]
			["position"] = {x = -1794.0, y = 3082.8, z = 32.8, h = 149.4}, -- ตำแหน่งประตูวาป (กด E ใกล้ๆจะมีเมนูวาปให้ยืนยัน)   
			
			["anim"] = {
				
				["enable"] = true, -- จะให้มีเอนิเมชั่นตอนวาปไหม ถ้าไม่จะวาปไปดื้อๆเลย
				["dict"] = "anim@arena@celeb@podium@no_prop@",  -- dict หรือ หมวดหมู่ของเอนิเมชั่น 
				["name"] = "regal_c_1st", -- ชื่ออนิเมชั่น
				
			},
			
			["progressbar"] = { -- หลอดโหลด
				
				["tittle"] = "['คำสั่งวาป']", -- หัวข้อบน progressbar
				["text"] = "กำลังทำการย้ายพื้นที่", -- ข้อความบน progressbar
				["time"] = 3000, -- เวลาในการวาป
			},
			
			["confirm"] = {
				
				["enable"] = true, -- จะให้ยืนยันตอนกดวาปไหม ถ้าเป็น false กดแล้วก็จะวาปเลย?
				["text"] = "คุณต้องการไป AFK หรือไม่", -- ข้อความยืนยันตอนวาป
				
			},
			
			["text"] = {
				
				["enable"] = true, -- เปิดใช้งานข้อความไหม
				["size"] = 1.5, -- ขนาด text
				["text"] = "กดปุ่ม E เพื่อไป AFK", -- ข้อความที่จะแสดงจุดวาปถ้าเว้นว่างไว้จะเป็นการโชว์ชื่อจุดวาปแทน
				
			}
			
			
		},
		
	},
	
}
