Config = {}

Config["Setting"] = {
	
	["Key"] = 38 , -- ปุ่มที่จะใช้วาป  https://docs.fivem.net/docs/game-references/controls/
	["allowed_vehicle"] = false, -- จะให้วาปไปทั้งรถทั้งคนเลยไหม ?
	
}

Config["Menu"] = {
	
	["enable"] = false, -- เปิดให้ใช้เมนูวาปไหม ?
	["position"] = "top-right", -- ตำแหน่งของเมนู
	
}

Config["Text"] = {
	
	["menu_tittle"] = "เมนูวาป", -- หัวข้อเมนู
	
}

Config["Warp"] = {
	
	[1] = { -- หัวข้อหลัก
		
		["enable"] = false, -- จะเปิดหมวดหมู่นี้ไหม ถ้าปรับเป็น false จะไม่โชว์
		["name"] = "โซนวาปเมืองหลัก", -- ชื่อหมวดหมู่
		
		["List"] = { -- รายชื่อวาปทั้งหมด	
			
			[1] = {
				
				["enable"] = false, -- ถ้าปรับเป็น false จะไม่ขึ้นในหมวดหมู่ /tp
				["name"] = "ทางเข้า TC", -- ชื่อจุดวาป [0x03]
				["position"] = { x = 3830.7, y = 794.5, z = 81.8, h = 213.1 }, -- ตำแหน่งที่จะวาปไป (h = heading จุดที่จะหันหน้าไป)
				
			},
			
			[2] = {
				
				["enable"] = false, -- ถ้าปรับเป็น false จะไม่ขึ้นในหมวดหมู่ /tp
				["name"] = "ออกไปTC", -- ชื่อจุดวาป [0x03]
				["position"] = { x = -827.1, y = -1327.4, z = 4.9, h = 334.4 }, -- ตำแหน่งที่จะวาปไป (h = heading จุดที่จะหันหน้าไป)
				
			},
		},
	}
}

Config["Gate"] = {
	
	["Setting"] = {
		
		["enable"] = true, -- เปิดใช้งานเกทวาปทั้งหมดไหม ?
		["font"] = "font4thai",
		["delay"] = 1000, -- เวลาในการกดเปิดวาปแต่ละครั้ง
		["draw_dist_text"] = 10.0, -- ระยะที่จะโชว์ข้อความ
		["draw_dist_press"] = 2.0, -- ระยะที่จะกดปุ่มได้ 
		
	},
	
	["List"] = {
		-- 1
		{
			
			["enable"] = false, -- เปิดจุดนี้ไหม ?
			["catalog"] = 1, -- หมวดหมู่ อิงจาก [0x01]
			["name"] = 1, -- ชื่อวาปที่จะวาปไป ดูได้จาก Config["List"] อิงจาก [0x03]
			["position"] = { x = -794.1, y = -1347.9, z = 5.1, h = 107.4 }, -- ตำแหน่งประตูวาป (กด E ใกล้ๆจะมีเมนูวาปให้ยืนยัน)
			
			["anim"] = {
				
				["enable"] = true, -- จะให้มีเอนิเมชั่นตอนวาปไหม ถ้าไม่จะวาปไปดื้อๆเลย
				["dict"] = "anim@arena@celeb@podium@no_prop@",  -- dict หรือ หมวดหมู่ของเอนิเมชั่น 
				["name"] = "regal_c_1st", -- ชื่ออนิเมชั่น
				
			},
			
			["progressbar"] = { -- หลอดโหลด
				
				["tittle"] = "['คำสั่งวาป']", -- หัวข้อบน progressbar
				["text"] = "กำลังทำการย้ายพื้นที่", -- ข้อความบน progressbar
				["time"] = 3000, -- เวลาในการวาป
			},
			
			["confirm"] = {
				
				["enable"] = true, -- จะให้ยืนยันตอนกดวาปไหม ถ้าเป็น false กดแล้วก็จะวาปเลย?
				["text"] = "คุณต้องการเดินเข้าไปในพื้นที่ของ TC หรือไม่", -- ข้อความยืนยันตอนวาป
				
			},
			
			["text"] = {
				
				["enable"] = true, -- เปิดใช้งานข้อความไหม
				["size"] = 1.5, -- ขนาด text
				["text"] = "กดปุ่ม E เพื่อวาปเข้าไปยัง TC", -- ข้อความที่จะแสดงจุดวาปถ้าเว้นว่างไว้จะเป็นการโชว์ชื่อจุดวาปแทน
				
			}
			
			
		},
		-- 2
		{
			
			["enable"] = false, -- เปิดจุดนี้ไหม ?
			["catalog"] = 1, -- หมวดหมู่ อิงจาก [0x01]
			["name"] = 2, -- ชื่อวาปที่จะวาปไป ดูได้จาก Config["List"] อิงจาก [0x03]
			["position"] = { x = 3827.2, y = 800.5, z = 81.8, h = 33.5 }, -- ตำแหน่งประตูวาป (กด E ใกล้ๆจะมีเมนูวาปให้ยืนยัน)
			
			["anim"] = {
				
				["enable"] = true, -- จะให้มีเอนิเมชั่นตอนวาปไหม ถ้าไม่จะวาปไปดื้อๆเลย
				["dict"] = "anim@arena@celeb@podium@no_prop@",  -- dict หรือ หมวดหมู่ของเอนิเมชั่น 
				["name"] = "regal_c_1st", -- ชื่ออนิเมชั่น
				
			},
			
			["progressbar"] = { -- หลอดโหลด
				
				["tittle"] = "['คำสั่งวาป']", -- หัวข้อบน progressbar
				["text"] = "กำลังทำการย้ายพื้นที่", -- ข้อความบน progressbar
				["time"] = 3000, -- เวลาในการวาป
			},
			
			["confirm"] = {
				
				["enable"] = true, -- จะให้ยืนยันตอนกดวาปไหม ถ้าเป็น false กดแล้วก็จะวาปเลย?
				["text"] = "คุณต้องการเดินเข้าไปในพื้นที่ของ TC หรือไม่", -- ข้อความยืนยันตอนวาป
				
			},
			
			["text"] = {
				
				["enable"] = true, -- เปิดใช้งานข้อความไหม
				["size"] = 1.5, -- ขนาด text
				["text"] = "กดปุ่ม E เพื่อวาปเข้าไปยัง TC", -- ข้อความที่จะแสดงจุดวาปถ้าเว้นว่างไว้จะเป็นการโชว์ชื่อจุดวาปแทน
				
			}
		},
	},
}
